{
    "architectures": [
      "MxDNAForMaskedLM"
    ],
    "attention_dropout": 0.0,
    "pad_token_id":0,
    "unk_token_id": 1,
    "cls_token_id": 2,
    "sep_token_id": 3,
    "mask_token_id": 4,
    "hidden_act": "silu",
    "hidden_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "max_position_embeddings": 2048,
    "model_type": "mxdna",
    "num_attention_heads": 16,
    "num_experts_per_tok": 1,
    "num_hidden_layers": 21,
    "num_key_value_heads": 16,
    "num_local_experts": 10,
    "layer_norm_eps": 1e-05,
    "rope_theta": 10000.0,
    "router_aux_loss_coef": 0.01,
    "torch_dtype": "float16",
    "transformers_version": "4.36.0.dev0",
    "vocab_size": 9,
    "expert_kernel_sizes": [1,2,3,4,5,6,7,8,9,10],
    "conversion_layer_idx": 4,
    "router_jitter_noise": 0.01,
    "num_motif_groups": 1,
    "deformable_conv_kernel_size":3
  }
